-- 개념적 설계
-------------------------------------
-- 회원			게시글		댓글
-------------------------------------
-- ID:PK		ID:PK		ID:PK
-------------------------------------
-- 이름			작성자:FK		작성자:FK
-- 나이			제목			게시글:FK
--				내용			댓글내용
--				작성일자		작성일자

-- 기본키(PK)
-- 각 테이블마다 반드시 하나는 있어야 하는
-- 각 행(레코드)을 고유하게 구분하게 해주는 식별자 역할

-- 외래키(FK)
-- 다른 테이블의 PK를 참조하는 참조키를 의미한다.
-- 이를 통해 두 테이블의 관계를 정의하고 FK를 통해
-- 각 레코드 간의 연결에 일관성을 부여한다.

-- 논리적 설계

-- 정규화
-- 정규화는 제 4정규화까지 진행되며, 일반적으로 제2정규화
-- 혹은 제3정규화까지만 진행된다.
-- 제1정규화(1NF)
-- 모든 컬럼이 원자값으로 구성되어야 한다.
-- 원자값이란, 더 이상 쪼갤 수 없는 가장 작은 정보 덩어리
-- 이는 데이터의 일관성을 유지하고 중복을 방지하는 데 중요한
-- 역할을 한다.
-- 예) 주소: ~~시 / ~~구 / ~~동

-- 제2정규화(2NF)
-- 제1정규형을 만족하면서 부분 종속성을 제거
-- 부분 종속성이란, PK의 일부에만 종속된 속성을 가리키며,
-- 이런 컬럼들은 별도의 테이블로 분리하여 관리하는 것으로
-- 제2정규형을 만족할 수 있다.
-- 예) 주문 테이블에서 주문번호만으로 결정되는 주문 내용

-- 제3정규화(3NF)
-- 제2정규형을 만족하면서 이행 종속성을 제거한다.
-- 기본키가 아닌 컬럼 간의 종속 관계 제거
-- 예) 고객 테이블에서(고객 정보) 주소 부분은 별도의 테이블로 분리하여
-- 관리하는 것을 제3정규화라고 할 수 있다.

-- BCNF(보이스-코드 정규형)
-- 제3정규형을 강화한 정규형으로, 일부 특수한 경우에 처리한다.

-- 물리적 설계
-- 논리적 설계를 바탕으로 실제 데이터가 데이터베이스에 들어갈 때의
-- 그 구조를 실제 코드로 구현하는 것을 가리킨다.
-- 여러 제약조건을 포함하여 실제 코드로 작성